# ─── Common Taps ──────────────────────────────────────────────────────────────
tap "jenkins-zh/jcli"
tap "lusingander/tap"
tap "teamookla/speedtest"
tap "tylerbrock/saw"

# ─── Common Brews (cross-platform) ───────────────────────────────────────────
brew "age"
brew "awscli"
brew "bat"
brew "btop"
brew "cf2tf"
brew "colima"
brew "cryptography"
brew "docker"
brew "docker-buildx"
brew "duckdb"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "ghostscript"
brew "git-delta"
brew "gitui"
brew "glow"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "hadolint"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jp"
brew "jpeg-xl"
brew "jq"
brew "jsonlint"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libraw"
brew "librsvg"
brew "libxmlsec1"
brew "luacheck"
brew "markdownlint-cli"
brew "mdcat"
brew "mpv"
brew "mycli"
brew "ncurses"
brew "neovim"
brew "nmap"
brew "node"
brew "nvm"
brew "oath-toolkit"
brew "ollama", restart_service: :changed
brew "openapi-generator"
brew "openjdk@17"
brew "openjdk@21"
brew "openssh"
brew "opentofu"
brew "pandoc"
brew "pass"
brew "pass-otp"
brew "pgcli"
brew "pinentry"
brew "pipx"
brew "poppler"
brew "postgresql@14"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "python@3.13"
brew "qemu"
brew "rain"
brew "rancher-cli"
brew "ranger"
brew "repomix"
brew "ripgrep"
brew "shellcheck"
brew "teamookla/speedtest/speedtest"
brew "stow"
brew "terraform-docs"
brew "tesseract"
brew "tflint"
brew "tig"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "unbound"
brew "uv"
brew "w3m"
brew "watch"
brew "websocat"
brew "wget"
brew "yamllint"
brew "yarn"
brew "ykman"
brew "yt-dlp"
brew "zbar"
brew "zsh-completions"
brew "jenkins-zh/jcli/jcli"
brew "lusingander/tap/stu"
brew "tylerbrock/saw/saw"

# ─── Go Packages (cross-platform) ────────────────────────────────────────────
go "github.com/Clever/csvlint/cmd/csvlint"
go "github.com/ethereum/go-ethereum/cmd/abigen"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/go-swagger/go-swagger/cmd/swagger"
go "github.com/google/wire/cmd/wire"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/securego/gosec/v2/cmd/gosec"
go "golang.org/x/tools/gopls"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "honnef.co/go/tools/cmd/staticcheck"

# ─── macOS Only ───────────────────────────────────────────────────────────────
if OS.mac?
  tap "jorgelbg/tap"
  tap "ngrok/ngrok"
  tap "steipete/tap"
  tap "yakitrak/yakitrak"

  brew "gh"
  brew "mas"
  brew "pinentry-mac"
  brew "pngpaste"
  brew "telnet"
  brew "jorgelbg/tap/pinentry-touchid"
  brew "steipete/tap/remindctl"
  brew "yakitrak/yakitrak/obsidian-cli"

  cask "beyond-compare"
  cask "chatgpt-atlas"
  cask "claude"
  cask "codex"
  cask "cursor"
  cask "dbeaver-community"
  cask "font-fira-code-nerd-font"
  cask "font-hack-nerd-font"
  cask "font-jetbrains-mono-nerd-font"
  cask "fork"
  cask "ghostty"
  cask "google-chrome"
  cask "intellij-idea-ce"
  cask "iterm2"
  cask "itsycal"
  cask "mitmproxy"
  cask "ngrok/ngrok/ngrok"
  cask "obsidian"
  cask "openemu"
  cask "postman"
  cask "redis-insight"
  cask "sequel-ace"
  cask "session-manager-plugin"
  cask "slack"
  cask "steam"
  cask "visual-studio-code"
  cask "whatsapp"
  cask "windsurf"
  cask "xbar"
  cask "zed"
  cask "zoom"

  mas "Monosnap", id: 540348655
  mas "Numbers", id: 409203825
  mas "Windows App", id: 1295203466
end

# ─── Linux Only ───────────────────────────────────────────────────────────────
if OS.linux?
  # Add Linux-specific packages here
  flatpak "com.google.Chrome"
  flatpak "md.obsidian.Obsidian"
end
